[{"date": "2021-03-10T23:30:00+00:00", "title": "Priority Technology Holdings, Inc. Announces Fourth Quarter and Full-Year 2020 Financial Results Release Date and Conference Call Information", "content": "ALPHARETTA, Ga., March 10, 2021 /PRNewswire/ -- Priority Technology Holdings, Inc. (NASDAQ: PRTH) (\"Priority\" or the \"Company\"), a leading payments technology company, today announced that it will release its fourth quarter and full-year 2020 financial results after the close of financial markets on Tuesday, March 16, 2021.\n\nIn addition, the Company will host a conference call and webcast to review its financial and operating results. A question-and-answer session will follow.\n\nFourth Quarter and Full-Year 2020 Conference Call\n\nWednesday, March 17, 2021\r\n11:00 a.m. Eastern Time\r\nPhone: US/Canada: (877) 501-3161 or International: (786) 815-8443 \r\nInternet webcast link and accompanying slide presentation can be accessed at https://edge.media-server.com/mmc/p/9rjzgeoo and will also be posted in the \"Investor Relations\" section of the Company's website at www.PRTH.com.\n\nAn audio replay of the call will be available shortly after the conference call until March 20, 2021 at 1:30 pm Eastern Time. To listen to the audio replay, dial (855) 859-2056 or (404) 537-3406 and enter conference ID number 6918659. Alternatively, you may access the webcast replay in the \"Investor Relations\" section of the Company's website at www.PRTH.com.\n\nAbout Priority Technology Holdings, Inc. Priority is a leading provider of merchant acquiring, integrated payment software and corporate payment solutions, offering unique product and service capabilities to its merchant network and distribution partners. Priority's enterprise operates from a purpose-built payments infrastructure that includes tailored customer service offerings and bespoke technology development, allowing the Company to provide end-to-end solutions for payment and payment-adjacent software. Additional information can be found at www.PRTH.com. Cision\n\nView original content:http://www.prnewswire.com/news-releases/priority-technology-holdings-inc-announces-fourth-quarter-and-full-year-2020-financial-results-release-date-and-conference-call-information-301245092.html\n\nSOURCE Priority Technology Holdings, Inc.", "link": "https://finance.yahoo.com/news/priority-technology-holdings-inc-announces-233000944.html?.tsrc=rss", "symbols": ["PRTH.US", "PRTHU.US"], "tags": ["INC", "COMPANY", "FOURTH QUARTER", "FINANCIAL RESULTS", "FINANCIAL MARKETS", "PRIORITY TECHNOLOGY HOLDINGS", "PRIORITY"]}]